log-slash-home-without-optimization.log
Phase started: Warm up (index: 0, duration: 100s) 17:53:37(+0530)

--------------------------------------
Metrics for period to: 17:53:40(+0530) (width: 2.086s)
--------------------------------------

http.codes.200: ................................................................ 22
http.codes.401: ................................................................ 25
http.request_rate: ............................................................. 36/sec
http.requests: ................................................................. 66
http.response_time:
  min: ......................................................................... 10
  max: ......................................................................... 756
  median: ...................................................................... 63.4
  p95: ......................................................................... 295.9
  p99: ......................................................................... 320.6
http.responses: ................................................................ 47
vusers.completed: .............................................................. 47
vusers.created: ................................................................ 67
vusers.created_by_name.0: ...................................................... 67
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 23.7
  max: ......................................................................... 765.3
  median: ...................................................................... 90.9
  p95: ......................................................................... 314.2
  p99: ......................................................................... 333.7


--------------------------------------
Metrics for period to: 17:53:50(+0530) (width: 9.931s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 3
http.codes.200: ................................................................ 50
http.codes.401: ................................................................ 158
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 301
http.response_time:
  min: ......................................................................... 54
  max: ......................................................................... 3275
  median: ...................................................................... 572.6
  p95: ......................................................................... 2101.1
  p99: ......................................................................... 2836.2
http.responses: ................................................................ 208
vusers.completed: .............................................................. 208
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 3
vusers.session_length:
  min: ......................................................................... 59.8
  max: ......................................................................... 3282.9
  median: ...................................................................... 572.6
  p95: ......................................................................... 2101.1
  p99: ......................................................................... 2836.2


--------------------------------------
Metrics for period to: 17:54:00(+0530) (width: 9.916s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 80
http.codes.200: ................................................................ 34
http.codes.401: ................................................................ 143
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 251
  max: ......................................................................... 8573
  median: ...................................................................... 1587.9
  p95: ......................................................................... 8024.5
  p99: ......................................................................... 8520.7
http.responses: ................................................................ 177
vusers.completed: .............................................................. 177
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 80
vusers.session_length:
  min: ......................................................................... 262.1
  max: ......................................................................... 8580.7
  median: ...................................................................... 1620
  p95: ......................................................................... 8024.5
  p99: ......................................................................... 8520.7


--------------------------------------
Metrics for period to: 17:54:10(+0530) (width: 9.904s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 104
http.codes.200: ................................................................ 10
http.codes.401: ................................................................ 128
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1192
  max: ......................................................................... 9323
  median: ...................................................................... 2101.1
  p95: ......................................................................... 8868.4
  p99: ......................................................................... 9230.4
http.responses: ................................................................ 138
vusers.completed: .............................................................. 138
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 104
vusers.session_length:
  min: ......................................................................... 1202.9
  max: ......................................................................... 9338
  median: ...................................................................... 2101.1
  p95: ......................................................................... 8868.4
  p99: ......................................................................... 9230.4


--------------------------------------
Metrics for period to: 17:54:20(+0530) (width: 9.886s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 158
http.codes.401: ................................................................ 150
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 2130
  max: ......................................................................... 3898
  median: ...................................................................... 2836.2
  p95: ......................................................................... 3905.8
  p99: ......................................................................... 3905.8
http.responses: ................................................................ 150
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 158
vusers.session_length:
  min: ......................................................................... 2138.6
  max: ......................................................................... 3908.5
  median: ...................................................................... 2836.2
  p95: ......................................................................... 3905.8
  p99: ......................................................................... 3905.8


--------------------------------------
Metrics for period to: 17:54:30(+0530) (width: 9.882s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 153
http.codes.401: ................................................................ 162
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 3126
  max: ......................................................................... 4788
  median: ...................................................................... 3905.8
  p95: ......................................................................... 4492.8
  p99: ......................................................................... 4770.6
http.responses: ................................................................ 162
vusers.completed: .............................................................. 162
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 153
vusers.session_length:
  min: ......................................................................... 3132.6
  max: ......................................................................... 4795.9
  median: ...................................................................... 3905.8
  p95: ......................................................................... 4492.8
  p99: ......................................................................... 4770.6


--------------------------------------
Metrics for period to: 17:54:40(+0530) (width: 9.867s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 148
http.codes.401: ................................................................ 117
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 3390
  max: ......................................................................... 5541
  median: ...................................................................... 4583.6
  p95: ......................................................................... 5272.4
  p99: ......................................................................... 5487.5
http.responses: ................................................................ 117
vusers.completed: .............................................................. 117
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 148
vusers.session_length:
  min: ......................................................................... 3395.9
  max: ......................................................................... 5546.6
  median: ...................................................................... 4583.6
  p95: ......................................................................... 5272.4
  p99: ......................................................................... 5487.5


--------------------------------------
Metrics for period to: 17:54:50(+0530) (width: 9.899s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 138
http.codes.401: ................................................................ 155
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 4800
  max: ......................................................................... 5920
  median: ...................................................................... 5378.9
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 5944.6
http.responses: ................................................................ 155
vusers.completed: .............................................................. 155
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 138
vusers.session_length:
  min: ......................................................................... 4806.2
  max: ......................................................................... 5925.8
  median: ...................................................................... 5378.9
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 5944.6


--------------------------------------
Metrics for period to: 17:55:00(+0530) (width: 9.89s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 123
http.codes.401: ................................................................ 132
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 5147
  max: ......................................................................... 6895
  median: ...................................................................... 5944.6
  p95: ......................................................................... 6702.6
  p99: ......................................................................... 6838
http.responses: ................................................................ 132
vusers.completed: .............................................................. 132
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 123
vusers.session_length:
  min: ......................................................................... 5154.1
  max: ......................................................................... 6900.8
  median: ...................................................................... 6064.7
  p95: ......................................................................... 6702.6
  p99: ......................................................................... 6838


Phase completed: Warm up (index: 0, duration: 100s) 17:55:17(+0530)

--------------------------------------
Metrics for period to: 17:55:10(+0530) (width: 9.905s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 158
http.codes.401: ................................................................ 166
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 6148
  max: ......................................................................... 7832
  median: ...................................................................... 6838
  p95: ......................................................................... 7557.1
  p99: ......................................................................... 7865.6
http.responses: ................................................................ 166
vusers.completed: .............................................................. 166
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 158
vusers.session_length:
  min: ......................................................................... 6154.8
  max: ......................................................................... 7837.9
  median: ...................................................................... 6976.1
  p95: ......................................................................... 7557.1
  p99: ......................................................................... 7865.6


--------------------------------------
Metrics for period to: 17:55:20(+0530) (width: 9.679s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 153
http.codes.401: ................................................................ 118
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 233
http.response_time:
  min: ......................................................................... 7104
  max: ......................................................................... 8717
  median: ...................................................................... 7865.6
  p95: ......................................................................... 8520.7
  p99: ......................................................................... 8520.7
http.responses: ................................................................ 118
vusers.completed: .............................................................. 118
vusers.created: ................................................................ 233
vusers.created_by_name.0: ...................................................... 233
vusers.failed: ................................................................. 153
vusers.session_length:
  min: ......................................................................... 7109.1
  max: ......................................................................... 9078.9
  median: ...................................................................... 7865.6
  p95: ......................................................................... 8520.7
  p99: ......................................................................... 8520.7


--------------------------------------
Metrics for period to: 17:55:30(+0530) (width: 7.476s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 106
http.codes.401: ................................................................ 106
http.response_time:
  min: ......................................................................... 8043
  max: ......................................................................... 8954
  median: ...................................................................... 8692.8
  p95: ......................................................................... 8868.4
  p99: ......................................................................... 8868.4
http.responses: ................................................................ 106
vusers.completed: .............................................................. 106
vusers.failed: ................................................................. 106
vusers.session_length:
  min: ......................................................................... 8050.6
  max: ......................................................................... 8960.1
  median: ...................................................................... 8692.8
  p95: ......................................................................... 8868.4
  p99: ......................................................................... 8868.4


All VUs finished. Total time: 1 minute, 51 seconds

--------------------------------
Summary report @ 17:55:27(+0530)
--------------------------------

errors.ETIMEDOUT: .............................................................. 1324
http.codes.200: ................................................................ 116
http.codes.401: ................................................................ 1560
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 3000
http.response_time:
  min: ......................................................................... 10
  max: ......................................................................... 9323
  median: ...................................................................... 4147.4
  p95: ......................................................................... 8352
  p99: ......................................................................... 8868.4
http.responses: ................................................................ 1676
vusers.completed: .............................................................. 1676
vusers.created: ................................................................ 3000
vusers.created_by_name.0: ...................................................... 3000
vusers.failed: ................................................................. 1324
vusers.session_length:
  min: ......................................................................... 23.7
  max: ......................................................................... 9338
  median: ...................................................................... 4147.4
  p95: ......................................................................... 8352
  p99: ......................................................................... 8868.4